04_OpenFoam/_ref/OpenFOAM-14/isothermalFluid/potentialFreeSurfaceOscillatingBox/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [pressure];

internalField   uniform 0;

boundaryField
{
    freeSurface
    {
        type            waveSurfacePressure;
        value           uniform 0;
    }
    walls
    {
        type            zeroGradient;
    }
    floatingObject
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
