04_OpenFoam/_ref/OpenFOAM-14/isothermalFluid/potentialFreeSurfaceOscillatingBox/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

forces
{
    type            forces;
    libs            ("libforces.so");
    writeControl    writeTime;
    patches         (floatingObject);
    rho             rhoInf;
    log             yes;
    rhoInf          1000;
    CofR            (0 0 0);
}

poolHeight
{
    type            surfaceFieldValue;
    libs            ("libfieldFunctionObjects.so");
    writeControl    timeStep;
    writeInterval   1;
    log             yes;
    writeTotalArea  no;
    writeFields     no;
    faceZone
    {
        type        box;
        box         (-100 0.9 -100) (0.2 100 100);

        zone
        {
            type        patch;
            patch       freeSurface;
        }
    }
    operation       areaAverage;
    fields
    (
        zeta
    );
}

// ************************************************************************* //
